podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/FMC_MK65F18.svd.xml
            <cluster>
               <dim>4</dim>
               <dimIncrement>64</dimIncrement>
               <dimIndex>0,1,2,3</dimIndex>
               <name>DATAW,@pDATAW@i@f</name>
               <addressOffset>0x200</addressOffset>
               <register>
                  <name>S0UM</name>
                  <description>Cache Data Storage (uppermost word)</description>
                  <addressOffset>0x0</addressOffset>
                  <fields>
                     <field>
                        <name>data</name>
                        <description>Bits [127:96] of data entry</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>S0MU</name>
                  <description>Cache Data Storage (mid-upper word)</description>
                  <addressOffset>0x4</addressOffset>
                  <fields>
                     <field>
                        <name>data</name>
                        <description>Bits [95:64] of data entry</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>S0ML</name>
                  <description>Cache Data Storage (mid-lower word)</description>
                  <addressOffset>0x8</addressOffset>
                  <fields>
                     <field>
                        <name>data</name>
                        <description>Bits [63:32] of data entry</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>S0LM</name>
                  <description>Cache Data Storage (lowermost word)</description>
                  <addressOffset>0xC</addressOffset>
                  <fields>
                     <field>
                        <name>data</name>
                        <description>Bits [31:0] of data entry</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>S1UM</name>
                  <description>Cache Data Storage (uppermost word)</description>
                  <addressOffset>0x10</addressOffset>
                  <fields>
                     <field>
                        <name>data</name>
                        <description>Bits [127:96] of data entry</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>S1MU</name>
                  <description>Cache Data Storage (mid-upper word)</description>
                  <addressOffset>0x14</addressOffset>
                  <fields>
                     <field>
                        <name>data</name>
                        <description>Bits [95:64] of data entry</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>S1ML</name>
                  <description>Cache Data Storage (mid-lower word)</description>
                  <addressOffset>0x18</addressOffset>
                  <fields>
                     <field>
                        <name>data</name>
                        <description>Bits [63:32] of data entry</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>S1LM</name>
                  <description>Cache Data Storage (lowermost word)</description>
                  <addressOffset>0x1C</addressOffset>
                  <fields>
                     <field>
                        <name>data</name>
                        <description>Bits [31:0] of data entry</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>S2UM</name>
                  <description>Cache Data Storage (uppermost word)</description>
                  <addressOffset>0x20</addressOffset>
                  <fields>
                     <field>
                        <name>data</name>
                        <description>Bits [127:96] of data entry</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>S2MU</name>
                  <description>Cache Data Storage (mid-upper word)</description>
                  <addressOffset>0x24</addressOffset>
                  <fields>
                     <field>
                        <name>data</name>
                        <description>Bits [95:64] of data entry</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>S2ML</name>
                  <description>Cache Data Storage (mid-lower word)</description>
                  <addressOffset>0x28</addressOffset>
                  <fields>
                     <field>
                        <name>data</name>
                        <description>Bits [63:32] of data entry</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>S2LM</name>
                  <description>Cache Data Storage (lowermost word)</description>
                  <addressOffset>0x2C</addressOffset>
                  <fields>
                     <field>
                        <name>data</name>
                        <description>Bits [31:0] of data entry</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>S3UM</name>
                  <description>Cache Data Storage (uppermost word)</description>
                  <addressOffset>0x30</addressOffset>
                  <fields>
                     <field>
                        <name>data</name>
                        <description>Bits [127:96] of data entry</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>S3MU</name>
                  <description>Cache Data Storage (mid-upper word)</description>
                  <addressOffset>0x34</addressOffset>
                  <fields>
                     <field>
                        <name>data</name>
                        <description>Bits [95:64] of data entry</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>S3ML</name>
                  <description>Cache Data Storage (mid-lower word)</description>
                  <addressOffset>0x38</addressOffset>
                  <fields>
                     <field>
                        <name>data</name>
                        <description>Bits [63:32] of data entry</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>S3LM</name>
                  <description>Cache Data Storage (lowermost word)</description>
                  <addressOffset>0x3C</addressOffset>
                  <fields>
                     <field>
                        <name>data</name>
                        <description>Bits [31:0] of data entry</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
            </cluster>
         </registers>
      </peripheral>
